In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

In [100]:
df_demographics = pd.read_csv("London ward data demographics(1).csv", sep='\t')
display(df_demographics.loc[521]['Wardname'])

'Richmond upon Thames - Ham, Petersham & Richmond Riverside    19.1237762915576    16.7    15.9    30.5    7.6'

| Variable Name | Description |
|:-------------------------------:|:-----------:|
|       Wardname                 |  Wardname         |
| Children | |
| Greeaterthan65 | % All Older people aged 65+ - 2011 |
| nonwhite | % BAME - 2011 |
| NotBorninUK | % Not Born in UK - 2011 |
| NotEnglishspeaking | % English is First Language of no one in the household - 2011 |

In [101]:
df_demographics.loc[520:522]

,Wardname,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
520,Islington - Saint Peter's,14.819827,9.8,25.6,32.0,9.5
521,"Richmond upon Thames - Ham, Petersham & Richmo...",NaN,NaN,NaN,NaN,NaN
522,Richmond upon Thames - Mortlake & Barnes Common,19.791190,12.0,11.7,25.6,5.2

In [103]:
added = ["Richmond upon Thames - Ham, Petersham & Richmond Riverside", 19.1237762915576, 16.7, 15.9, 30.5, 7.6]

In [104]:
length = len(df_demographics)
df_demographics.loc[length] = added
df_demographics

,Wardname,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
0,Hackney - Queensbridge,17.542063,8.2,44.7,38.3,11.8
1,Hammersmith & Fulham - S&s End,17.915361,8.4,30.6,39.0,11.8
2,Barking & Dagenham - River,26.851598,10.1,38.4,30.9,9.6
3,Tower Hamlets - Bethnal Green North,18.555872,7.0,49.4,38.7,15.0
4,Merton - Abbey,15.731861,8.5,26.6,38.3,12.5
...,...,...,...,...,...,...
619,Lambeth - Coldharbour,21.562202,6.1,62.1,43.7,13.3
620,Newham - Plaistow North,23.600517,7.1,73.4,52.1,23.6
621,Greenwich - Abbey Wood,26.853031,9.6,46.3,32.0,7.6
622,Southwark - South Camberwell,19.684852,7.1,44.1,35.8,7.7
623,"Richmond upon Thames - Ham, Petersham & Richmo...",19.123776,16.7,15.9,30.5,7.6

In [107]:
df_demographics.drop(df_demographics.index[[521]], inplace=True)

In [108]:
df_demographics.loc[520:522]

,Wardname,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
520,Islington - Saint Peter's,14.819827,9.8,25.6,32.0,9.5
522,Richmond upon Thames - Mortlake & Barnes Common,19.791190,12.0,11.7,25.6,5.2

In [109]:
info=pd.DataFrame(df_demographics.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(df_demographics.isna().sum()).T.rename(index={0:'Null values count'}))
info=info.append(pd.DataFrame(df_demographics.isna().sum()/df_demographics.shape[0]*100).T.
                         rename(index={0:'Null values (%)'}))
info=info.append(pd.DataFrame(df_demographics.min()).T.rename(index={0:'Min values'}))
info=info.append(pd.DataFrame(df_demographics.max()).T.rename(index={0:'Max values'}))
info

,Wardname,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
Data type,object,float64,float64,float64,float64,float64
Null values count,0,0,0,0,0,0
Null values (%),0.0,0.0,0.0,0.0,0.0,0.0
Min values,Barking & Dagenham - Abbey,7.133676,3.5,4.1,5.1,0.4
Max values,Westminster - Westbourne,33.187914,23.5,93.7,68.5,99.7

In [28]:
#df_environment = pd.read_csv("London ward data environment(1).csv")
#df_environment

#info=pd.DataFrame(df_environment.dtypes).T.rename(index={0:'Data type'})
#info=info.append(pd.DataFrame(df_environment.isna().sum()).T.rename(index={0:'Null values count'}))
#info=info.append(pd.DataFrame(df_environment.isna().sum()/df_environment.shape[0]*100).T.
#                         rename(index={0:'Null values (%)'}))
#info=info.append(pd.DataFrame(df_environment.min()).T.rename(index={0:'Min values'}))
#info=info.append(pd.DataFrame(df_environment.max()).T.rename(index={0:'Max values'}))
#info

| Variable Name | Description |
|:-------------------------------:|:-----------:|
|       Crimerate                 | Crime rate - 2011/12         |
| Population2011Cencus | Population 2011 (Cencus) |
| Openspace | % area that is open space - 2012 |

In [112]:
df_health = pd.read_csv("london ward data health(1).csv")
df_health

,Unnamed: 0,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy
0,0,Bromley - Darwin,5110.0,63.8,81.2,82.4
1,1,Kensington and Chelsea - Royal Hospital,7252.0,52.3,80.5,89.6
2,2,Hillingdon - Harefield,7399.0,55.8,78.3,82.3
3,3,Hammersmith and Fulham - Palace Riverside,7483.0,40.0,80.9,89.0
4,4,Kensington and Chelsea - Pembridge,7659.0,40.4,82.1,85.7
...,...,...,...,...,...,...
617,617,Greenwich - Woolwich Riverside,19120.0,84.4,73.8,80.2
618,618,Tower Hamlets - Blackwall and Cubitt Town,19461.0,75.1,77.4,83.4
619,619,Greenwich - Thamesmead Moorings,19730.0,122.5,74.3,77.5
620,620,Barnet - Childs Hill,20049.0,69.0,77.4,82.0
621,621,Tower Hamlets - Millwall,23084.0,58.1,83.6,95.0

| Variable Name | Description |
|:-------------------------------:|:-----------:|
| GeneralFertilityRate | General Fertility Rate - 2011 |
| Malelifeexpectancy | Male life expectancy - 2005-2009 |
| Femalelifeexpectancy | Female life expectancy - 2005-2009 |

In [113]:
df_health = df_health.drop('Unnamed: 0', axis=1)
df_health

,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy
0,Bromley - Darwin,5110.0,63.8,81.2,82.4
1,Kensington and Chelsea - Royal Hospital,7252.0,52.3,80.5,89.6
2,Hillingdon - Harefield,7399.0,55.8,78.3,82.3
3,Hammersmith and Fulham - Palace Riverside,7483.0,40.0,80.9,89.0
4,Kensington and Chelsea - Pembridge,7659.0,40.4,82.1,85.7
...,...,...,...,...,...
617,Greenwich - Woolwich Riverside,19120.0,84.4,73.8,80.2
618,Tower Hamlets - Blackwall and Cubitt Town,19461.0,75.1,77.4,83.4
619,Greenwich - Thamesmead Moorings,19730.0,122.5,74.3,77.5
620,Barnet - Childs Hill,20049.0,69.0,77.4,82.0
621,Tower Hamlets - Millwall,23084.0,58.1,83.6,95.0

In [114]:
info=pd.DataFrame(df_health.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(df_health.isna().sum()).T.rename(index={0:'Null values count'}))
info=info.append(pd.DataFrame(df_health.isna().sum()/df_health.shape[0]*100).T.
                         rename(index={0:'Null values (%)'}))
info=info.append(pd.DataFrame(df_health.min()).T.rename(index={0:'Min values'}))
info=info.append(pd.DataFrame(df_health.max()).T.rename(index={0:'Max values'}))
info

,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy
Data type,object,float64,float64,float64,float64
Null values count,0,0,0,0,0
Null values (%),0.0,0.0,0.0,0.0,0.0
Min values,Barking and Dagenham - Abbey,5110.0,22.1,71.2,75.9
Max values,Westminster - Westbourne,23084.0,130.2,178.0,99.6

In [29]:
#temp = df_health["Wardname"].str.split(" - ", n = 1, expand = True)
# 
#df_health["District"]= temp[0]
# 
# making separate last name column from new data frame
#df_health["Ward name"]= temp[1]
# 
# Dropping old Name columns
#df_health.drop(columns =["Wardname"], inplace = True)
 
#df_health

Population2011Census in df_health and df_environment are not in the same data type, so the one in df_health will be turnen into int64.

In [115]:
df_health['Population2011Census'] = df_health['Population2011Census'].astype(int)
info=pd.DataFrame(df_health.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(df_health.isna().sum()).T.rename(index={0:'Null values count'}))
info=info.append(pd.DataFrame(df_health.isna().sum()/df_health.shape[0]*100).T.
                         rename(index={0:'Null values (%)'}))
info=info.append(pd.DataFrame(df_health.min()).T.rename(index={0:'Min values'}))
info=info.append(pd.DataFrame(df_health.max()).T.rename(index={0:'Max values'}))
info

,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy
Data type,object,int32,float64,float64,float64
Null values count,0,0,0,0,0
Null values (%),0.0,0.0,0.0,0.0,0.0
Min values,Barking and Dagenham - Abbey,5110,22.1,71.2,75.9
Max values,Westminster - Westbourne,23084,130.2,178.0,99.6

There are 2 empty rows in the joined table, as shown above. \n
`00AYGN` = Lambeth - Stockwell
`00BCGL` = Redbridge - Loxford

Source: https://data.london.gov.uk/dataset/ward-profiles-and-atlas

In [116]:
df_demographics['Wardname'] = df_demographics['Wardname'].replace('&', 'and', regex=True)
df_health['Wardname'] = df_health['Wardname'].replace('&', 'and', regex=True)
df_demographics['Wardname'] = df_demographics['Wardname'].replace('St.', 'Saint', regex=True)
df_health['Wardname'] = df_health['Wardname'].replace('St.', 'Saint', regex=True)

In [117]:
df = pd.concat([df_health, df_demographics]) # concat dataframes
df = df.reset_index(drop=True) # reset the index
#df
df_gpby = df.groupby(list(df['Wardname'])) #group by
df_gpby
idx = [x[0] for x in df_gpby.groups.values() if len(x) == 1] #reindex
idx

[1010, 929, 67]

In [118]:
df.loc[idx]

,Wardname,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
1010,Lambeth - Saintckwell,NaN,NaN,NaN,NaN,18.379915,6.9,44.3,44.9,17.8
929,Redbridge - Loxford,NaN,NaN,NaN,NaN,29.025629,7.5,83.5,53.2,23.7
67,Sutton - The Wrythe,10163.0,63.8,77.5,83.9,NaN,NaN,NaN,NaN,NaN

In [79]:
df_demographics[df_demographics['Wardname'].str.contains('Richmond upon Thames')]

,Wardname,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking
5,Richmond upon Thames - South Richmond,16.552680,14.0,13.1,33.0,8.5
46,Richmond upon Thames - East Sheen,22.902976,13.9,9.3,23.6,5.5
51,Richmond upon Thames - Hampton,19.339009,15.8,11.3,16.7,4.0
89,Richmond upon Thames - North Richmond,18.659029,13.1,15.7,28.3,6.8
178,Richmond upon Thames - West Twickenham,21.789514,11.7,16.0,21.1,4.4
283,Richmond upon Thames - Twickenham Riverside,17.131589,12.4,10.3,26.8,7.2
313,Richmond upon Thames - Fulwell and Hampton Hill,21.133156,12.5,9.9,16.7,4.0
414,Richmond upon Thames - Hampton North,19.250027,15.7,16.3,20.1,5.4
438,Richmond upon Thames - Hampton Wick,20.438313,13.3,11.4,20.3,4.5
454,Richmond upon Thames - Kew,20.155649,13.9,15.3,30.2,7.6
472,Richmond upon Thames - Whitton,19.339623,16.3,21.5,23.3,6.7
488,Richmond upon Thames - Teddington,18.935140,13.6,8.9,17.8,4.1
499,Richmond upon Thames - Barnes,20.400039,14.7,14.3,32.2,8.3
504,Richmond upon Thames - Saint Margarets and Nor...,21.840315,9.5,12.3,23.3,4.8
516,Richmond upon Thames - South Twickenham,18.474016,10.3,9.7,18.8,4.0
521,"Richmond upon Thames - Ham, Petersham and Rich...",NaN,NaN,NaN,NaN,NaN
522,Richmond upon Thames - Mortlake and Barnes Common,19.791190,12.0,11.7,25.6,5.2
571,Richmond upon Thames - Heathfield,20.168719,14.8,30.4,26.6,8.7

In [31]:
#temp = df_demographics["Wardname"].str.split(" - ", n = 1, expand = True)
# 
#df_demographics["District"]= temp[0]
# 
# making separate last name column from new data frame
#df_demographics["Ward name"]= temp[1]
 
# Dropping old Name columns
#df_demographics.drop(columns =["Wardname"], inplace = True)
 
#df_demographics

In [16]:
health_demo=pd.merge(df_health,df_demographics,on='Ward name', how='left')
info=pd.DataFrame(health_demo.dtypes).T.rename(index={0:'Data type'})
info=info.append(pd.DataFrame(health_demo.isna().sum()).T.rename(index={0:'Null values count'}))
info

,Population2011Census,GeneralFertilityRate,Malelifeexpectancy,Femalelifeexpectancy,District_x,Ward name,Children,Greaterthan65,nonwhite,NotBorninUK,NotEnglishspeaking,District_y
Data type,int32,float64,float64,float64,object,object,float64,float64,float64,float64,float64,object
Null values count,0,0,0,0,0,0,3,3,3,3,3,3

In [34]:
#health_demo[health_demo['Greaterthan65'].isna()]

In [33]:
#health_demo